Repository: arikgreen/SRS_Game
Catalog: SRS_Game/Resources/Views/Documents/SrsDocument/_SrsDocBlankPartial.*.resx
Languages: pl

source: Acceptance criteria
pl: Kryteria akceptacyjne

source: Additional requirements
pl: Dodatkowe wymagania

# AdditionalRequirementsDsc
source: requirements that cannot be placed in any other category
pl: wymagania, które nie mieszczą się w zakresie poprzednich kategorii wymagań

source: Address
pl: Adres

source: Attachements
pl: Załączniki

source: Author
pl: Autor

source: Busines purpose
pl: Cel biznesowy

source: Busines purposes
pl: Cele biznesowe

source: Businsess purpose reference
pl: Ref. do celu biznesowego

source: Contact
pl: Kontakt

source: Content type
pl: Typ pliku

source: Credibility requirements
pl: Wymagania w zakresie wiarygodności

source: critical
pl: krytyczny

source: Critical situations
pl: Sytuacje krytyczne

source: Data requirements
pl: Wymagania dot. danych

source: Description
pl: Opis

source: Dictionary
pl: Słownik

source: Document
pl: Dokument

source: Emergancy situations
pl: Sytuacje awaryjne

source: Exceptions
pl: Sytuacje wyjątkowe

# ExcpSits
source: Exception situations
pl: Sytuacje wyjątkowe

source: Expected system components
pl: Przewidywane komponenty systemu

source: External systems
pl: Systemy zew.

source: Extraordinary situations
pl: Sytuacje nadzwyczajne

source: File name
pl: Nazwa pliku

source: Flexibility requirements
pl: Wymagania w zakresie elastyczności

source: Functionality purposes
pl: Cele funkcjonalne

source: Functionality requirement reference
pl: Ref. do wymagania funkcjonalnego

source: Functionality requirements
pl: Wymagania funkcjonalne

source: Hardware component reference
pl: Ref. do komponentu sprzętowego

source: Hardware components
pl: Komponenty sprzętowe

source: Hardware requirements
pl: Wymaganie w zakresie sprzętu

source: high
pl: wysoki

# HwReqAgreeClient
source: Configuration agreed with the client
pl: Konfiguracja uzgodniona z klientem

source: Introduction
pl: Wprowadzenie

source: low
pl: niski

source: medium
pl: średni

source: Name
pl: Nazwa

source: Needs
pl: Potrzeby

source: optional
pl: opcjonalny

source: Other systems reference
pl: Ref. do innych systemów

source: Performance requirements
pl: Wymagania w zakresie wydajności

# PersonlessSrc
source: Personless Source
pl: Źródła nieosobowe

source: Priority
pl: Priorytet

source: Project
pl: Projekt

source: Publisher
pl: Wydawca

source: Publishing date
pl: Data publikacji

source: Publishing place
pl: Miejsce publikacji

source: Quality requirements
pl: Wymagania jakościowe

source: Refers to
pl: Dotyczy

source: Relations
pl: Powiązania

source: Represent
pl: Reprezentat

source: Representats
pl: Reprezentuje

source: Requirements sources
pl: Żródła wymagań

source: Software component reference
pl: Ref. do komponentu programowego

source: Software components
pl: Komponenty programowe

source: Software requirements
pl: Wymagania programowe

source: Source
pl: Źródło

source: Stakeholder reference
pl: Ref. do interesariusza

source: Stakeholders of project
pl: Interesariusze projektu

source: Subsystem reference
pl: Ref. do podsystemu

source: Subsystems
pl: Podsystemy

source: Support for
pl: Wspiera

source: System environment
pl: Otoczenie systemu

source: System purposes
pl: Cele systemu

source: Tasks
pl: Zadania

source: Type
pl: Rodzaj

source: Updated date
pl: Zmodyfikowany

source: Usability requirements
pl: Wymaganie w zakresie użyteczności

# UserRef
source: System user reference
pl: Ref. użytkownika

source: Users
pl: Użytkownicy

source: Version
pl: Wersja

source: Title
pl: Tytuł

source: -- Select an option --
pl: -- Wybierz --
