Repository: arikgreen/SRS_Game
Catalog: IML.ModelEdit/Resources/MetamodelsStrings.*.resx
Languages: pl

source: Metamodels
pl: Metamodele

# Metamodels_Description_
source: Metamodels describe all available types of elements. Inheritance structure is shown in the tree view. Types marked with italic are abstract.
pl: Metamodele opisują wszystkie dostępne typy elemetów. W drzewie widoku pokazano strukturę dziedziczenia. Typy zaznaczone kursywą są abstrakcyjne.

# MetamodelsHint
source: Types marked with italic are abstract.
pl: Typy zaznaczone kursywą są abstrakcyjne.

source: Name
pl: Nazwa

source: Description:
pl: Opis:

source: Assembly
pl: Biblioteka

source: Display name
pl: Nazwa przyjazna

source: Abstract class
pl: Klasa abstrakcyjna

source: Metaclass properties
pl: Właściwości metaklasy

source: Details
pl: Szczegóły

# Metaclass_Properties_Hint_
source: Properties marked with italic are inherited.
pl: Właściwości zaznaczone kursywą są odziedziczone.

# Metaclass_Properties_Description_
source: Metaclass properies describe values that model element can hold.
pl: Właściwości metaklasy określają jakie wartości mogą być przypisywane do elementów modelu.

source: Property type
pl: Typ właściwości

# EnumType_Values_Hint_
source: Enum values
pl: Wartości wyliczane

# EnumValuesHint
source: Enum values can have integer values specified.
pl: Wartości wyliczane mogą mieć określone wartości całkowite.

# EnumType_Values_Description_
source: Enum values are named values that can be assigned to a property
pl: Wartości wyliczane to nazwane wartości, które mogą być przypisywane do właściwości.

# EnumValue
source: Value (integer)
pl: Wartość (całkowita)

source: Base type
pl: Typ bazowy

# ReferenceDefaultConstructorError
source: Reference default constructor not implemented.
pl: Domyślny konstruktor referencji nie jest zaimplementowany.

source: New metaclass
pl: Nowa metaklasa

# EditMetaclass
source: Edit metaclass definition
pl: Edycja definicji metaklasy

source: New metamodel
pl: Nowy metamodel

source: New enum type
pl: Nowy typ wyliczeniowy

# EditType
source: Edit type definition
pl: Edycja definicji typu

# EditMetamodel
source: Edit metamodel properties
pl: Edycja właściwości metamodelu

source: Delete metamodel
pl: Usuń metamodel

source: Delete metaclass
pl: Usuń metaklasę

source: Delete type
pl: Usuń typ

source: Namespace
pl: Przestrzeń nazw

source: Generate code
pl: Generowanie kodu

# MetamodelCompiled_1
source: Metamodel '{0}' compiled. Library '{1}' created.
pl: Metamodel '{0}' skompilowany. Utworzono bibliotekę '{1}'.

# MetamodelCompilationErrors_1
source: Metamodel '{0}' compilation errors
pl: Błędy kompilacji metamodelu '{0}'

source: New subclass
pl: Nowa klasa potomna

source: Edit enum type
pl: Edycja typu wyliczeniowego

source: Delete enum type
pl: Usuń typ wyliczeniowy

# DeleteMetaclassConfirm_1
source: Are you sure to delete metaclass {0}?
pl: Czy na pewno usunąć metaklasę {0}?

# DeleteEnumTypeConfirm_1
source: Are you sure to delete enum type {0}?
pl: Czy na pewno usunąć typ wyliczeniowy {0}?

# DeleteTypeConfirm_1
source: Are you sure to delete type {0}?
pl: Czy na pewno usunąć typ {0}?

source: New enum value
pl: Nowa wartość wyliczana

source: Delete enum value
pl: Usuń wartość wyliczaną

source: Edit enum value
pl: Edycja wartości wyliczanej

# DeleteEnumValueConfirm_1
source: Are you sure to delete enum value {0}?
pl: Czy na pewno usunąć wartość {0}?

# Name_Description_
source: Unique identifier. Only latin letters are accepted.
pl: Unikatowy identyfikator. Tylko litery łacińskie są akceptowane.

# Namespace_Description_
source: A sequence of identifiers separated by dots. Distinguishes names of elements defined in this model from elements defined in other models.
pl: Ciąg identyfikatorów oddzielonych kropkami. Odróżnia nazwy elementów zdefiniowanych w tym modelu od elementów zdefniniowanych w innych modelach.

# DisplayName_Description_
source: Display name is used in documents e.g. in specification tables. It can contain spaces and Unicode letters.
pl: Nazwa używana w dokumentach, np. w tabelkach specyfikacji. Może zawierać spacje i litery Unicode.

# Description_Description_
source: Explanation for designers. It can contain references to other elements.
pl: Objaśnienie dla projektantów. Może zawierać znaczniki referencji do innych elementów.

source: Assembly name
pl: Nazwa biblioteki

# Assembly_Description_
source: Assembly is a DLL that contains this model.
pl: Biblioteka DLL zawierająca ten model.

# AssemblyName_Description_
source: Name of a DLL that contains this model.
pl: Nazwa biblioteki DLL zawierającej ten model.

# BaseType_Description_
source: A type from which this class inherits properties.
pl: Typ, z którego dana klasa dziedziczy właściwości.

# AbstractClass_Description_
source: An abstract class cannot create elements, but can be used as a base type by other classes.
pl: Klasa abstrakcyjna nie może tworzyć elementów, lecz może służyć jako typ bazowy dla innych klas.

# PropertyType_Description_
source: A type of data available in this property.
pl: Typ danych udostępnianych przez tę właściwość.

# MultiProperty
source: List of
pl: Lista wartości

# MultiProperty_Description_
source: A property accepts many values.
pl: Właściwość akceptuje wiele wartości.

source: Edit class property
pl: Edycja właściwości klasy

source: Delete class property
pl: Usuń właściwość klasy

# DeleteClassPropertyConfirm_1
source: Are you sure to delete class property '{0}'?
pl: Czy na pewno usunąć właściwość klasy '{0}'?

source: New class property
pl: Nowa właściwość klasy

# EnumValue_Description_
source: Integer value assigned to a name.
pl: Wartość całkowita przypisana do nazwy.

source: Modeling
pl: Modelowanie
